{
  "doc_id": "3989ecd2-70ab-5af6-ac0a-b7b4cf230922",
  "req_key": "fintech::P-FT-022::REQ-031",
  "req_id": "REQ-031",
  "domain": "fintech",
  "prompt_id": "P-FT-022",
  "source": {
    "raw_path": "02_raw_requirements/fintech/P-FT-022/req-031_raw.txt",
    "refined_path": null,
    "origin": "raw_only"
  },
  "text": "Executive Summary\nMidState Credit Union is migrating a 2-million-record loan database from an aging on-premises SQL Server to Azure SQL Database and Amazon Kinesis by year-end. Driven by regulators flagging the data center’s single point of failure, this migration aims to improve reliability while retiring the outdated risk calculator. The roadmap balances the mandated migration with the CFO’s expectation for real-time ML risk scoring, focusing on a feasible approach given no data science resources or budget. In-Scope Migration\nMigrate 2 million loan records from on-premises SQL Server to Azure SQL Database, eliminating the single point of failure.\nReplace legacy DTS jobs with modern cloud ETL processes to maintain data workflows.\nDecommission the legacy VB risk calculator and implement an interim risk-scoring method until a new ML solution is ready.\nSet up a new Azure environment configured for high availability and compliance.\nIntegrate Amazon Kinesis for real-time streaming to support future ML-driven analytics.\nOut-of-Scope\n✗ Development of an ML risk scoring system by the migration deadline (no data science team or budget).\n✗ Adopting third-party migration or ETL tools (limited to native Azure services and in-house methods).\n✗ Continued operation of the legacy VB risk calculator after migration. AI Ambitions Table\nIdea | Effort(pts) | ROI\nBatch ML risk model | 5 | Moderate\nReal-time ML risk scoring | 8 | High\nContinuous-learning AI model | 13 | Risks & Questions\n[NOTE: legacy DTS] Rewriting legacy DTS packages in a modern ETL environment may be error-prone due to lack of documentation.\nNo in-house data science expertise to deliver the CFO’s ML risk scoring vision, so external help may be needed.\nAn aggressive year-end deadline may strain resources, risking cut corners or migration issues if complexities arise.\nOpen questions remain about the new Azure/Kinesis setup (compliance, staff training, and cloud cost management).",
  "structured_data": null
}